## Queries for sales data

In [1]:
%reload_ext sql
%sql postgresql://postgres:pgAdmin@localhost/sales
    
%sql select * from sellers_data limit 10;

 * postgresql://postgres:***@localhost/sales
10 rows affected.

[('3442f8959a84dea7ee197c632cb2df15', '13023', 'campinas', 'SP'),
 ('d1b65fc7debc3361ea86b5f14c68d2e2', '13844', 'mogi guacu', 'SP'),
 ('ce3ad9de960102d0677a81f5d0bb7b2d', '20031', 'rio de janeiro', 'RJ'),
 ('c0f3eea2e14555b6faeea3dd58c1b1c3', '04195', 'sao paulo', 'SP'),
 ('51a04a8a6bdcb23deccc82b0b80742cf', '12914', 'braganca paulista', 'SP'),
 ('c240c4061717ac1806ae6ee72be3533b', '20920', 'rio de janeiro', 'RJ'),
 ('e49c26c3edfa46d227d5121a6b6e4d37', '55325', 'brejao', 'PE'),
 ('1b938a7ec6ac5061a66a3766e0e75f90', '16304', 'penapolis', 'SP'),
 ('768a86e36ad6aae3d03ee3c6433d61df', '01529', 'sao paulo', 'SP'),
 ('ccc4bbb5f32a6ab2b7066a4130f114e3', '80310', 'curitiba', 'PR')]

In [2]:
%sql select * from customers_data limit 5;

 * postgresql://postgres:***@localhost/sales
5 rows affected.

[('06b8999e2fba1a1fbc88172c00ba8bc7', '861eff4711a542e4b93843c6dd7febb0', '14409', 'franca', 'SP'),
 ('18955e83d337fd6b2def6b18a428ac77', '290c77bc529b7ac935b93aa66c333dc3', '09790', 'sao bernardo do campo', 'SP'),
 ('4e7b3e00288586ebd08712fdd0374a03', '060e732b5b29e8181a18229c7b0b2b5e', '01151', 'sao paulo', 'SP'),
 ('b2b6027bc5c5109e529d4dc6358b12c3', '259dac757896d24d7702b9acbbff3f3c', '08775', 'mogi das cruzes', 'SP'),
 ('4f2d8ab171c80ec8364f7c12e35b23ad', '345ecd01c38d18a9036ed96c73b8d066', '13056', 'campinas', 'SP')]

In [3]:
%sql select * from orders_data limit 5;

 * postgresql://postgres:***@localhost/sales
5 rows affected.

[('e481f51cbdc54678b7cc49136f2d6af7', '9ef432eb6251297304e76186b10a928d', 'delivered', datetime.datetime(2017, 10, 2, 10, 56, 33), datetime.datetime(2017, 10, 2, 11, 7, 15), datetime.datetime(2017, 10, 4, 19, 55), datetime.datetime(2017, 10, 10, 21, 25, 13), datetime.datetime(2017, 10, 18, 0, 0)),
 ('53cdb2fc8bc7dce0b6741e2150273451', 'b0830fb4747a6c6d20dea0b8c802d7ef', 'delivered', datetime.datetime(2018, 7, 24, 20, 41, 37), datetime.datetime(2018, 7, 26, 3, 24, 27), datetime.datetime(2018, 7, 26, 14, 31), datetime.datetime(2018, 8, 7, 15, 27, 45), datetime.datetime(2018, 8, 13, 0, 0)),
 ('47770eb9100c2d0c44946d9cf07ec65d', '41ce2a54c0b03bf3443c3d931a367089', 'delivered', datetime.datetime(2018, 8, 8, 8, 38, 49), datetime.datetime(2018, 8, 8, 8, 55, 23), datetime.datetime(2018, 8, 8, 13, 50), datetime.datetime(2018, 8, 17, 18, 6, 29), datetime.datetime(2018, 9, 4, 0, 0)),
 ('949d5b44dbf5de918fe9c16f97b45f8a', 'f88197465ea7920adcdbec7375364d82', 'delivered', datetime.datetime(2017, 11, 18, 19, 28, 6), datetime.datetime(2017, 11, 18, 19, 45, 59), datetime.datetime(2017, 11, 22, 13, 39, 59), datetime.datetime(2017, 12, 2, 0, 28, 42), datetime.datetime(2017, 12, 15, 0, 0)),
 ('ad21c59c0840e6cb83a9ceb5573f8159', '8ab97904e6daea8866dbdbc4fb7aad2c', 'delivered', datetime.datetime(2018, 2, 13, 21, 18, 39), datetime.datetime(2018, 2, 13, 22, 20, 29), datetime.datetime(2018, 2, 14, 19, 46, 34), datetime.datetime(2018, 2, 16, 18, 17, 2), datetime.datetime(2018, 2, 26, 0, 0))]

### Customers with orders >= 5

In [4]:
%%sql 

select 
    c.customer_id, 
    oi.order_id, 
    count(oi.order_id) as order_count
from orders_data as o
join customers_data as c
    on o.customer_id = c.customer_id
join order_items_data as oi
    on o.order_id = oi.order_id
group by c.customer_id, oi.order_id
having count(oi.order_id) >= 5
order by order_count desc
limit 10;

 * postgresql://postgres:***@localhost/sales
10 rows affected.

[('fc3d1daec319d62d49bfb5e1f83123e9', '8272b63d03f5f79c56e9e4120aec44ef', 21),
 ('be1b70680b9f9694d8c70f41fa3dc92b', '1b15974a0141d54e36626dca3fdc731a', 20),
 ('bd5d39761aa56689a265d95d8d32b8be', 'ab14fdcfbe524636d65ee38360e22ce8', 20),
 ('10de381f8a8d23fff822753305f71cae', '428a2f660dc84138d969ccd69a0ab6d5', 15),
 ('adb32467ecc74b53576d9d13a5a55891', '9ef13efd6949e4573a18964dd1bbe7f5', 15),
 ('d5f2b3f597c7ccafbb5cac0bcc3d6024', '73c8ab38f07dc94389065f7eba4f297a', 14),
 ('a7693fba2ff9583c78751f2b66ecab9d', '9bdc4d4c71aa1de4606060929dee888c', 14),
 ('7d321bd4e8ba1caf74c4c1aabd9ae524', '37ee401157a3a0b28c9c6d0ed8c3b24b', 13),
 ('3b54b5978e9ace64a63f90d176ffb158', 'c05d6a79e55da72ca780ce90364abed9', 12),
 ('0d93f21f3e8543a9d0d8ece01561f5b2', '2c2a19b5703863c908512d135aa6accc', 12)]

### Sales by region and cities

In [5]:
%%sql

select
    c.customer_city,
    c.customer_state,
    sum(op.payment_value) as total_sales
from customers_data as c
join orders_data as o 
    on c.customer_id = o.customer_id
join order_payments_data as op
    on o.order_id = op.order_id
join geolocation_data as gl
    on c.customer_zip_code_prefix = gl.geolocation_zip_code_prefix
group by c.customer_state, c.customer_city
order by total_sales desc
limit 10;

 * postgresql://postgres:***@localhost/sales
10 rows affected.

[('rio de janeiro', 'RJ', Decimal('325852833.83')),
 ('sao paulo', 'SP', Decimal('196911310.44')),
 ('belo horizonte', 'MG', Decimal('114087356.52')),
 ('niteroi', 'RJ', Decimal('76032491.78')),
 ('curitiba', 'PR', Decimal('40672264.74')),
 ('santos', 'SP', Decimal('37379097.32')),
 ('porto alegre', 'RS', Decimal('37224648.37')),
 ('salvador', 'BA', Decimal('31202471.91')),
 ('uberlandia', 'MG', Decimal('29594577.11')),
 ('campinas', 'SP', Decimal('25350088.16'))]

### Sales by category

In [6]:
%%sql

select
    pcn.product_category_name_english as category_name,
    sum(op.payment_value) as total_sales
FROM order_items_data as oi
join order_payments_data as op
    on oi.order_id = op.order_id
join products_data as p 
    on oi.product_id = p.product_id
join product_category_name as pcn
    on p.product_category_name = pcn.product_category_name
group by pcn.product_category_name_english
order by total_sales desc
limit 5;

 * postgresql://postgres:***@localhost/sales
5 rows affected.

[('bed_bath_table', Decimal('1712553.67')),
 ('health_beauty', Decimal('1657373.12')),
 ('computers_accessories', Decimal('1585330.45')),
 ('furniture_decor', Decimal('1430176.39')),
 ('watches_gifts', Decimal('1429216.68'))]

## Top Sellers with timeframe

In [8]:
%%sql

select
    s.seller_id,
    sum(oi.price + oi.freight_value) as total_sales,
    count(o.order_approved_at) as cnt
from sellers_data as s
join order_items_data as oi on s.seller_id = oi.seller_id
join orders_data as o on oi.order_id = o.order_id
group by s.seller_id
order by total_sales desc
limit 10

 * postgresql://postgres:***@localhost/sales
10 rows affected.

[('4869f7a5dfa277a7dca6462dcf3b52b2', Decimal('249640.70'), 1156),
 ('7c67e1448b00f6e969d365cea6b010ab', Decimal('239536.44'), 1364),
 ('53243585a1d6dc2643021fd1853d8905', Decimal('235856.68'), 410),
 ('4a3ca9315b744ce9f8e9374361493884', Decimal('235539.96'), 1987),
 ('fa1c13f2614d7b5c4749cbc52fecda94', Decimal('204084.73'), 586),
 ('da8622b14eb17ae2831f4ac5b9dab84a', Decimal('185192.32'), 1551),
 ('7e93a43ef30c4f03f38b393420bc753a', Decimal('182754.05'), 340),
 ('1025f0e2d44d7041d6cf58b6550e0bfa', Decimal('172860.69'), 1428),
 ('7a67c85e85bb2ce8582c35f2203ad736', Decimal('162648.38'), 1168),
 ('955fee9216a65b617aa5c0531780ce60', Decimal('160602.68'), 1499)]